In [2]:

import pandas as pd

In [3]:
nba=pd.read_csv("nba.csv")
nba

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [4]:
nba["Team"].unique()

array(['Boston Celtics', 'Brooklyn Nets', 'New York Knicks',
       'Philadelphia 76ers', 'Toronto Raptors', 'Golden State Warriors',
       'Los Angeles Clippers', 'Los Angeles Lakers', 'Phoenix Suns',
       'Sacramento Kings', 'Chicago Bulls', 'Cleveland Cavaliers',
       'Detroit Pistons', 'Indiana Pacers', 'Milwaukee Bucks',
       'Dallas Mavericks', 'Houston Rockets', 'Memphis Grizzlies',
       'New Orleans Pelicans', 'San Antonio Spurs', 'Atlanta Hawks',
       'Charlotte Hornets', 'Miami Heat', 'Orlando Magic',
       'Washington Wizards', 'Denver Nuggets', 'Minnesota Timberwolves',
       'Oklahoma City Thunder', 'Portland Trail Blazers', 'Utah Jazz',
       nan], dtype=object)

In [5]:
nba["Team"].nunique()

30

In [6]:
emp = pd.read_csv("employees.csv")
emp

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,08-06-1993,12.42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6.53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11.17 AM,130590,11.858,False,Finance
3,Jerry,Male,03-04-2005,1.00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4.47 PM,101004,1.389,True,NaN
...,...,...,...,...,...,...,...,...
995,Henry,NaN,11/23/2014,6.09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6.30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12.39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4.45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6.24 PM,129949,10.169,True,Sales

In [7]:
emp["Gender"].unique()

array(['Male', 'Female', nan], dtype=object)

In [8]:
emp["Gender"].nunique(dropna=True)

2

In [17]:
emp["Gender"].nunique()

2

In [18]:
len(emp["Gender"].unique())

3